work/depot/app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 3)
---
  def add_to_cart
    begin
      product = Product.find(params[:id])